Tasks/Задача.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Task>
		<Properties>
			<Name>Задача</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Статусы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧасыРук</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийПользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<AddressingAttribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>Создатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

Enums/Статусы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>Статусы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Tasks/Задача/Forms/ФормаСпискаЗадачТекПользователя/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Процедура ОбновитьСтатусЗадач(МассивЗадач, НовыйСтатус)
	Для каждого ТекЗадача Из МассивЗадач Цикл
		
		ЗадачаОбъект = ТекЗадача.ПолучитьОбъект();
		   //Проверка на смену статуса
		Если ЗадачаОбъект.Статус = НовыйСтатус Тогда
			
			Продолжить
			 
		КонецЕсли;
		
	 	  		
		   //Проверка на возврат задачи из статуса "исполнена" в другой
		   
		Если ЗадачаОбъект.Статус = Перечисления.Статусы.Исполнена И НЕ(НовыйСтатус = Перечисления.Статусы.Исполнена)   Тогда
		    
			ЗадачаОбъект.Выполнена = Ложь;
			ЗадачаОбъект.ДатаЗавершения = "";
			
		КонецЕсли;

		ЗадачаОбъект.Статус = НовыйСтатус;
		  //Проверка на переход задачи в статус "исполнена"  		
		Если НовыйСтатус = Перечисления.Статусы.Исполнена Тогда
			ЗадачаОбъект.Выполнена = Истина;
			ЗадачаОбъект.ДатаЗавершения = ТекущаяДата();
		КонецЕсли;	
		
		Попытка
			ЗадачаОбъект.Записать();
		Исключение 
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось изменить статус задачи" + "по причине" + ОписаниеОшибки();
			Сообщение.Сообщить();
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусыЗадачКлиент(МассивЗадач, НовыйСтатус)

	 Если ТипЗнч(МассивЗадач) = Тип("Массив")  Тогда
		 ОбновитьСтатусЗадач(МассивЗадач, НовыйСтатус);
	 КонецЕсли;
	 
	 ОповеститьОбИзменении(Тип("ЗадачаСсылка.Задача"));


КонецПроцедуры 
 

&НаКлиенте
Процедура НоваяПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	 ОбновитьСтатусыЗадачКлиент( ПараметрыПеретаскивания.Значение, ПредопределенноеЗначение("Перечисление.Статусы.Новая"));
		 
КонецПроцедуры

&НаКлиенте
Процедура ВРаботеПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	ОбновитьСтатусыЗадачКлиент( ПараметрыПеретаскивания.Значение, ПредопределенноеЗначение("Перечисление.Статусы.ВРаботе"));

КонецПроцедуры

&НаКлиенте
Процедура ИсполненаПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	ОбновитьСтатусыЗадачКлиент( ПараметрыПеретаскивания.Значение, ПредопределенноеЗначение("Перечисление.Статусы.Исполнена"));

КонецПроцедуры


&НаСервере
Процедура ПриОткрытииНаСервере()
	//Установка параметров для произвольного запроса
	Новая.Параметры.УстановитьЗначениеПараметра("ТекущийПользователь",ПараметрыСеанса.ТекущийПользователь);
	ВРаботе.Параметры.УстановитьЗначениеПараметра("ТекущийПользователь",ПараметрыСеанса.ТекущийПользователь);
	Исполнена.Параметры.УстановитьЗначениеПараметра("ТекущийПользователь",ПараметрыСеанса.ТекущийПользователь);
	
	//Запрос для вывода сообщения о просрочках		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задача.Ссылка КАК Ссылка,
		|	Задача.ВерсияДанных КАК ВерсияДанных,
		|	Задача.ПометкаУдаления КАК ПометкаУдаления,
		|	Задача.Номер КАК Номер,
		|	Задача.Дата КАК Дата,
		|	Задача.Наименование КАК Наименование,
		|	Задача.Выполнена КАК Выполнена,
		|	Задача.Описание КАК Описание,
		|	Задача.СрокВыполнения КАК СрокВыполнения,
		|	Задача.Статус КАК Статус,
		|	Задача.ДатаЗавершения КАК ДатаЗавершения,
		|	Задача.ЧасыРук КАК ЧасыРук,
		|	Задача.ТекущийПользователь КАК ТекущийПользователь,
		|	Задача.Исполнитель КАК Исполнитель,
		|	Задача.Создатель КАК Создатель,
		|	Задача.Представление КАК Представление
		|ИЗ
		|	Задача.Задача КАК Задача
		|ГДЕ
		|	Задача.Исполнитель = &ТекущийПользователь
		|	ИЛИ Задача.Создатель = &ТекущийПользователь";
	
	Запрос.УстановитьПараметр("ТекущийПользователь", ПараметрыСеанса.ТекущийПользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.СрокВыполнения <= ТекущаяДата()+86400 и НЕ(Выборка.Статус = Перечисления.Статусы.Исполнена)  Тогда
			               //Проверка на срок исполнения в 1 день

			Если Выборка.СрокВыполнения >= ТекущаяДата() Тогда
			
				   Сообщить("Для выполнения задачи " + Выборка.Наименование + " осталось меньше 1 дня" );

			
			Иначе        	//Проверка на просрочку срока выполнения

			
				        Сообщить("Срок сдачи задачи " + Выборка.Наименование + " просрочен");

			
			КонецЕсли;
			
			
			
		
	  КонецЕсли;

	КонецЦикла;

	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
	КонецПроцедуры

&НаКлиенте
	Процедура НеоцененныеЗадачи(Команда)
		ОткрытьФорму("Задача.Задача.Форма.ФормаСпискаНеоцененныеЗадачи");
	КонецПроцедуры

&НаКлиенте
	Процедура ВсеЗадачи(Команда)
		ОткрытьФорму("Задача.Задача.Форма.ФормаСписка");
	КонецПроцедуры
